src/main/java/ok/dht/test/monakhov/report/stage4/wrk2_put_rate_1500.txt
Running 30s test @ http://localhost:19234
  16 threads and 16 connections
  Thread calibration: mean lat.: 266.183ms, rate sampling interval: 902ms
  Thread calibration: mean lat.: 272.338ms, rate sampling interval: 915ms
  Thread calibration: mean lat.: 256.814ms, rate sampling interval: 872ms
  Thread calibration: mean lat.: 260.464ms, rate sampling interval: 882ms
  Thread calibration: mean lat.: 263.604ms, rate sampling interval: 895ms
  Thread calibration: mean lat.: 267.507ms, rate sampling interval: 901ms
  Thread calibration: mean lat.: 262.594ms, rate sampling interval: 898ms
  Thread calibration: mean lat.: 267.257ms, rate sampling interval: 900ms
  Thread calibration: mean lat.: 262.077ms, rate sampling interval: 889ms
  Thread calibration: mean lat.: 265.702ms, rate sampling interval: 899ms
  Thread calibration: mean lat.: 267.587ms, rate sampling interval: 901ms
  Thread calibration: mean lat.: 262.386ms, rate sampling interval: 889ms
  Thread calibration: mean lat.: 267.501ms, rate sampling interval: 902ms
  Thread calibration: mean lat.: 266.739ms, rate sampling interval: 906ms
  Thread calibration: mean lat.: 262.259ms, rate sampling interval: 883ms
  Thread calibration: mean lat.: 267.053ms, rate sampling interval: 904ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.47ms   13.19ms  70.78ms   87.56%
    Req/Sec    93.34      2.05   100.00     86.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.78ms
 75.000%    8.98ms
 90.000%   28.78ms
 99.000%   61.50ms
 99.900%   68.09ms
 99.990%   70.33ms
 99.999%   70.85ms
100.000%   70.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.844     0.000000            1         1.00
       3.255     0.100000         3008         1.11
       3.657     0.200000         6002         1.25
       4.009     0.300000         9001         1.43
       4.367     0.400000        12018         1.67
       4.779     0.500000        14996         2.00
       5.011     0.550000        16495         2.22
       5.311     0.600000        18003         2.50
       5.739     0.650000        19486         2.86
       6.747     0.700000        20984         3.33
       8.983     0.750000        22485         4.00
      10.527     0.775000        23229         4.44
      13.415     0.800000        23979         5.00
      16.527     0.825000        24729         5.71
      19.375     0.850000        25478         6.67
      23.503     0.875000        26226         8.00
      26.511     0.887500        26602         8.89
      28.783     0.900000        26978        10.00
      31.279     0.912500        27350        11.43
      36.543     0.925000        27725        13.33
      41.407     0.937500        28100        16.00
      42.847     0.943750        28289        17.78
      44.639     0.950000        28478        20.00
      46.911     0.956250        28662        22.86
      49.855     0.962500        28849        26.67
      51.647     0.968750        29041        32.00
      52.447     0.971875        29131        35.56
      53.247     0.975000        29223        40.00
      54.335     0.978125        29318        45.71
      55.711     0.981250        29411        53.33
      57.631     0.984375        29505        64.00
      58.751     0.985938        29551        71.11
      59.903     0.987500        29601        80.00
      60.895     0.989062        29647        91.43
      61.887     0.990625        29692       106.67
      62.655     0.992188        29740       128.00
      63.103     0.992969        29764       142.22
      63.487     0.993750        29785       160.00
      63.999     0.994531        29811       182.86
      64.607     0.995313        29832       213.33
      65.023     0.996094        29856       256.00
      65.151     0.996484        29868       284.44
      65.727     0.996875        29881       320.00
      65.983     0.997266        29892       365.71
      66.239     0.997656        29903       426.67
      66.623     0.998047        29914       512.00
      67.135     0.998242        29923       568.89
      67.263     0.998437        29927       640.00
      67.519     0.998633        29932       731.43
      67.903     0.998828        29938       853.33
      68.159     0.999023        29943      1024.00
      68.351     0.999121        29946      1137.78
      68.479     0.999219        29949      1280.00
      68.799     0.999316        29952      1462.86
      68.863     0.999414        29955      1706.67
      69.311     0.999512        29958      2048.00
      69.375     0.999561        29959      2275.56
      69.695     0.999609        29961      2560.00
      69.823     0.999658        29962      2925.71
      69.887     0.999707        29964      3413.33
      69.951     0.999756        29965      4096.00
      70.015     0.999780        29967      4551.11
      70.015     0.999805        29967      5120.00
      70.015     0.999829        29967      5851.43
      70.207     0.999854        29968      6826.67
      70.335     0.999878        29969      8192.00
      70.335     0.999890        29969      9102.22
      70.527     0.999902        29970     10240.00
      70.527     0.999915        29970     11702.86
      70.527     0.999927        29970     13653.33
      70.655     0.999939        29971     16384.00
      70.655     0.999945        29971     18204.44
      70.655     0.999951        29971     20480.00
      70.655     0.999957        29971     23405.71
      70.655     0.999963        29971     27306.67
      70.847     0.999969        29972     32768.00
      70.847     1.000000        29972          inf
#[Mean    =       10.473, StdDeviation   =       13.192]
#[Max     =       70.784, Total count    =        29972]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44996 requests in 29.98s, 2.88MB read
Requests/sec:   1500.80
Transfer/sec:     98.20KB